[
    {
        "Q": "What does the graph represent?",
        "A": "The graph represents a network of animals. Each node represents an animal, and each edge represents a relationship between two animals."
    },
    {
        "Q": "What information is displayed on the left column?",
        "A": "The left column displays information about the object (node or edge) that the mouse is currently hovering over. You can use this to compare animals with the actively selected one on the right column."
    },
    {
        "Q": "What information is displayed on the right column?",
        "A": "The right column displays information about the object (node or edge) that was last clicked on."
    },
    {
        "Q": "What does the color of the nodes represent?",
        "A": "The color of the nodes represents the degree of the node, that is, the number of connections it has to other nodes."
    },
    {
        "Q": "Why did the save fail?",
        "A": "Whenever we press the save button, we are actually saving a version of the graph and a neural network trained on it. However, sometimes the neural network fails to train. This is usually because the graph is too small, and therefore there is not enough data to train the neural network. In order to solve this, you need to collect more data and add it to the graph."
    },
    {
        "Q": "Why did the prediction fail?",
        "A": "Like model training, predictions also rely on the neural network trained on your graph. If the graph is too small, there might not be a sufficiently trained neural network to predict the social connections."
    },
    {
        "Q": "What kind of information can I find in the Graph Analytics page?",
        "A": "The Graph Analytics page provides comprehensive insights about the social graph. It includes a chord diagram that visualizes the connections between animal attribute values, information on community structure including modularity, correlation coefficients showing the relationship between edge existence and attribute similarity, and a range of graph metrics like number of nodes/edges, density, diameter, average degree/clustering, and centralities."
    },
    {
        "Q": "I cannot scroll on Graph Analytics page. What should I do?",
        "A": "Our application is still in its beta stage, so some features may not be fully optimized yet. Currently, to scroll, you need to move your cursor over the scrollbar."
    },
    {
        "Q": "What does the Evolution tab show exactly?",
        "A": "The Evolution tab presents a history of the changes made to the graph over time. It displays a timeline of saved versions of the graph, highlighting key metrics at each step: the mean degree of nodes, the mean clustering coefficient, and the total number of nodes. You can navigate through different time steps to observe how these metrics have evolved from time to time."
    },
    {
        "Q": "I made changes to the graph but Evolution tab is not updating. What should I do?",
        "A": "On the evolution tab, we only present the saved versions of the graph. If you add a new node, edge or predict new social connections, they will not immediately show up on the evolution tab. You need to save the graph first."
    }
]